Revit 2027 API
StairsRunJustification Enumeration
 The position of the run relative to the Up-direction path used to create the run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsRunJustification
Public Enumeration StairsRunJustification
public enum class StairsRunJustification
type StairsRunJustification
Members
Member name | Value | Description
Center | 1 |  The creation path for the run is the center.
Left | 0 |  The creation path for the run is the left edge.
LeftExterior | 3 |  The creation path for the run is the left stringer exterior edge.
Right | 2 |  The creation path for the run is the right edge.
RightExterior | 4 |  The creation path for the run is the right stringer exterior edge.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace